
import React from "react";
import { Link } from "react-router-dom";
import SelfPossibilityImage from "../../assets/images/SelfPoindex-box_5.1600w.jpg";

const features = [
  {
    title: "Custom colors, layouts, and menus",
    description:
      "With complete access to the product's modules, structure, and contents, you can change the UI elements to match your corporate needs and style.",
  },
  {
    title: "Additional eLearning tools",
    description:
      "Use the e-Learning module to structure knowledge inside your company and create training courses for your employees.",
  },
  {
    title: "Localization tools",
    description:
      "Available in 6 languages (English, German, French, Portuguese, Spanish, Polish) and even more available through partners. With our built-in localization tools, you can make your own translation.",
  },
];

const SelfPossibilities = () => {
  return (
    <section className="bg-white">
      
      <div className="p-20 text-center">
        <h1 className="text-[30px] mb-6 ">
          Unlimited possibilities
        </h1>
        <p className="text-[20px] text-gray-900">
          With a full front-end and backend access to the product code, the on-premise version of Bitrix24 gives you virtually unlimited possibilities for customization and localization.
        </p>
      </div>

      

      <div className="flex flex-col md:flex-row items-center justify-between px-6 md:px-12 py-5  mb-8">
      <div className="md:w-1/2 flex justify-center">
          <img src={SelfPossibilityImage} alt="Self Hosted Bitrix24" className="max-w-full md:max-w-lg" />
        </div>
        <div className="md:w-1/2 space-y-4 ">
          {features.map((feature, index) => (
            <div key={index}>
              <h2 className="text-black font-bold">{feature.title}</h2>
              <p className=" text-[15px] text-gray-800">{feature.description}</p>
            </div>
          ))}

          <div className="flex gap-2 mt-4">
            <Link
              to="/"
              className="bg-[rgb(175,243,0)] text-black px-6 py-2 rounded-full font-semibold hover:bg-[rgb(190,243,0)]"
            >
              DOWNLOAD
            </Link>
            <Link
              to=""
              className="bg-blue-500 text-white px-6 py-3 rounded-full shadow-md hover:bg-blue-400 transition"
            >
              CONTACT BITRIX24 PARTNER
            </Link>
          </div>
        </div>

       
      </div>


      <div className=" max-h-screen  bg-gray-100 flex justify-center items-center w-full  ">
        <div className=" max-w-[1114px] w-full  flex flex-col lg:flex-row items-center justify-between px-5 p-4 ">
          <div>
              
              <span className=" p-4 flex justify-center items-center ">
             <svg width="30"  height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 230.33 230.33"><defs><style></style></defs><g id="Слой_2" fill="#1fc1e5" data-name="Слой 2"><g id="Слой_1-2" data-name="Слой 1"><path class="cls-1" d="M0 0v200.61h65.92a55.67 55.67 0 0098.5 0h65.91V0zm91.16 147.62a66.48 66.48 0 00-5.54 23.27H67.06a48.08 48.08 0 0113.31-29.68 44.72 44.72 0 0010.79 6.41zM86 136.19a48 48 0 0118.27-8.6 75.54 75.54 0 00-9.77 13.35 39.67 39.67 0 01-8.5-4.75zm-19 42.13h18.62a66.48 66.48 0 005.54 23.28 44.6 44.6 0 00-10.79 6.4 48.08 48.08 0 01-13.31-29.68zM86 213a40.45 40.45 0 018.51-4.76 75.65 75.65 0 009.77 13.36A48.06 48.06 0 0186 213zm25.43 5.3a70 70 0 01-9.63-12.44 54.74 54.74 0 019.63-1.45zm0-40V197a62.06 62.06 0 00-13.21 2.13 59.13 59.13 0 01-5.19-20.82zm0-7.43H93.05a59.24 59.24 0 015.22-20.81 61.07 61.07 0 0013.18 2.12zm0-26.12a55.56 55.56 0 01-9.6-1.43 70.62 70.62 0 019.6-12.43zm24.35-3.83a75.53 75.53 0 00-9.78-13.33 48.09 48.09 0 0118.27 8.6 39.8 39.8 0 01-8.47 4.75zm14.16.27a48.08 48.08 0 0113.31 29.68h-18.54a66.26 66.26 0 00-5.54-23.27 44.72 44.72 0 0010.83-6.39zm-21.45 2.12a54.64 54.64 0 01-9.63 1.44v-13.87a70 70 0 019.65 12.45zm3.58 6.75a59.13 59.13 0 015.19 20.81h-18.4V152.2a61.88 61.88 0 0013.23-2.12zm5.19 28.24a59 59 0 01-5.21 20.81 61.79 61.79 0 00-13.17-2.11v-18.68zm-8.8 27.55a69.78 69.78 0 01-9.6 12.43v-13.84a55.41 55.41 0 019.62 1.43zM126 221.63a74.66 74.66 0 009.77-13.36 40 40 0 018.51 4.76 48.06 48.06 0 01-18.28 8.6zM150 208a44.6 44.6 0 00-10.79-6.41 66.48 66.48 0 005.54-23.28h18.56A48.13 48.13 0 01150 208zm72.93-14.83h-55.29a55.4 55.4 0 00-24.79-66.87h20.61v-7.43H44.58a11.16 11.16 0 01-11.14-11.14V78a11.16 11.16 0 0111.14-11.13h141.17A11.16 11.16 0 01196.9 78v29.72a11.16 11.16 0 01-11.15 11.14h-14.86v7.43h14.86a18.59 18.59 0 0018.58-18.57V78a18.59 18.59 0 00-18.58-18.58H44.58A18.59 18.59 0 0026 78v29.72a18.59 18.59 0 0018.57 18.57h42.9a55.4 55.4 0 00-24.79 66.87H7.43v-156H222.9zm0-163.46H7.43V7.43H222.9z"/><path class="cls-1" d="M78.05 77.56l-2.63 20.99-12.26-15.34-12.27 15.34-2.62-20.99-7.37.92 4.8 38.45 17.46-21.82 17.45 21.82 4.81-38.45-7.37-.92zM130.06 77.56l-2.63 20.99-12.26-15.34-12.27 15.34-2.62-20.99-7.37.92 4.8 38.45 17.46-21.82 17.45 21.82 4.81-38.45-7.37-.92zM182.07 77.56l-2.63 20.99-12.26-15.34-12.27 15.34-2.62-20.99-7.37.92 4.8 38.45 17.46-21.82 17.45 21.82 4.81-38.45-7.37-.92z"/></g></g></svg>
             </span>
             <p > Custom domain name</p> 
           </div>


            <div className="text-black hover:text-blue-300" >
              <span className=" p-4 flex justify-center items-center">
              <svg width="30"  height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 238.4 230.34"><defs><style></style></defs><g id="Слой_2" data-name="Слой 2"><g id="Слой_1-2" fill="#1fc1e5" data-name="Слой 1"><path class="cls-1" d="M237.89 210.48a15.88 15.88 0 00-30.76 0h-72.61a15.87 15.87 0 00-11.35-11.35v-24.39h95.31a19.89 19.89 0 0019.86-19.86v-23.83a19.77 19.77 0 00-8.07-15.88 19.79 19.79 0 008.07-15.89V75.45a19.78 19.78 0 00-8.07-15.88 19.79 19.79 0 008.07-15.89V19.86A19.88 19.88 0 00218.48 0H19.92A19.89 19.89 0 00.06 19.86v23.82a19.79 19.79 0 008.07 15.89A19.78 19.78 0 00.06 75.45v23.83a19.79 19.79 0 008.07 15.89 19.77 19.77 0 00-8.07 15.88v23.83a19.9 19.9 0 0019.86 19.86h95.31v24.39a15.87 15.87 0 00-11.35 11.35H31.27a15.88 15.88 0 100 7.94h72.61a15.81 15.81 0 0030.64 0h72.61a15.88 15.88 0 1030.76-7.94zM16 222.39a7.94 7.94 0 117.94-7.94 7.93 7.93 0 01-7.94 7.94zM8 43.68V19.86A11.92 11.92 0 0119.92 7.94h198.56a11.92 11.92 0 0111.92 11.92v23.82a11.92 11.92 0 01-11.92 11.92H19.92A11.92 11.92 0 018 43.68zm0 55.6V75.45a11.91 11.91 0 0111.92-11.91h198.56a11.92 11.92 0 0111.92 11.91v23.83a11.92 11.92 0 01-11.92 11.92H19.92A11.92 11.92 0 018 99.28zm11.91 67.51A11.91 11.91 0 018 154.88v-23.83a11.91 11.91 0 0111.91-11.91h198.57a11.92 11.92 0 0111.92 11.91v23.83a11.92 11.92 0 01-11.92 11.91zm99.28 55.6a7.94 7.94 0 117.94-7.94 7.93 7.93 0 01-7.93 7.94zm103.25 0a7.94 7.94 0 118-7.94 7.94 7.94 0 01-7.99 7.94z"/><path class="cls-1" d="M47.72 19.86H27.86a4 4 0 00-4 4v15.85a4 4 0 004 4h19.86a4 4 0 004-4V23.83a4 4 0 00-4-3.97zm-4 15.88H31.83V27.8h11.92zM47.72 75.45H27.86a4 4 0 00-4 4v15.86a4 4 0 004 4h19.86a4 4 0 004-4V79.43a4 4 0 00-4-3.98zm-4 15.89H31.83V83.4h11.92zM47.72 131.05H27.86a4 4 0 00-4 4v15.89a4 4 0 004 4h19.86a4 4 0 004-4V135a4 4 0 00-4-3.95zm-4 15.89H31.83V139h11.92zM210.54 15.89h-39.71a4 4 0 000 7.94h39.71a4 4 0 000-7.94zM210.54 31.77h-39.71a4 4 0 100 7.94h39.71a4 4 0 000-7.94zM210.54 71.48h-39.71a4 4 0 000 8h39.71a4 4 0 000-8zM210.54 87.37h-39.71a4 4 0 000 7.94h39.71a4 4 0 000-7.94zM210.54 127.08h-39.71a4 4 0 100 7.94h39.71a4 4 0 000-7.94zM210.54 143h-39.71a4 4 0 000 7.94h39.71a4 4 0 000-7.94z"/></g></g></svg>
              </span>
              <p > REST API, API</p> 
            </div>
           
            <div >

               <span className=" p-4 flex justify-center items-center">
               <svg    width="30"  height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 203.61 232.92"><g data-name="Слой 2"><path d="M181.48 79.67a79.68 79.68 0 00-159.35 0C10.76 81.09 0 88.53 0 105.79v41.61C0 166.87 13.63 174 26.56 174h12.83a4.43 4.43 0 004.43-4.43V83.84a4.43 4.43 0 00-4.43-4.43H31a70.83 70.83 0 01141.65 0h-8.41a4.43 4.43 0 00-4.43 4.43v85.56a4.42 4.42 0 004.43 4.42h8.41c-1.24 30.41-15.85 37.54-45 38.82v-3a8.86 8.86 0 00-8.85-8.86H90.92a8.86 8.86 0 00-8.85 8.86v14.38a8.86 8.86 0 008.85 8.86h27.93a8.86 8.86 0 008.85-8.86v-2.52c28.06-1.29 52.32-7.09 53.78-47.94 11.38-1.42 22.13-8.85 22.13-26.12v-41.61c0-17.35-10.71-24.74-22.13-26.16zM35 88v77h-8.66c-6.55 0-17.71-2.3-17.71-17.7v-41.64C8.63 90.39 19.65 88 26.34 88zm83.88 129.43v6.73H90.92v-14.44h27.93zm75.91-70c0 15.27-11 17.7-17.7 17.7h-8.41V88.26h8.63c6.55 0 17.7 2.3 17.7 17.71z" 
               fill="#1fc1e5" data-name="Слой 1"/></g></svg>
              </span>
              <p > Additional Helpdesk tools</p> 

            </div>
           
            <div className="text-black hover:text-blue-300" >
              
               <span className=" p-4 flex justify-center items-center">
               <svg width="30"  height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 187.18 230.34"><defs><style></style></defs><g id="Слой_2" fill="#1fc1e5" data-name="Слой 2"><g id="Слой_1-2" data-name="Слой 1"><path class="cls-1" d="M10.48 230.34H176.7a10.5 10.5 0 0010.48-10.48V10.48A10.5 10.5 0 00176.7 0H10.48A10.49 10.49 0 000 10.48v209.38a10.49 10.49 0 0010.48 10.48zm170-202V96H6.75V28.3zm-3.78 195.25H10.48a3.74 3.74 0 01-3.73-3.73v-117.1h173.68v117.1a3.74 3.74 0 01-3.73 3.73zm3.71-213.49v11.46h-152V6.75H176.7a3.74 3.74 0 013.71 3.35zm-173.66.38a3.73 3.73 0 013.73-3.73h11.25v14.81h-15z"/><path class="cls-1" d="M56.21 122.35H23.72a7.11 7.11 0 00-7.1 7.11v40.95a7.11 7.11 0 007.1 7.1h32.49a7.12 7.12 0 007.11-7.1v-40.95a7.12 7.12 0 00-7.11-7.11zm.36 48.06a.36.36 0 01-.36.35H23.72a.35.35 0 01-.35-.35v-40.95a.36.36 0 01.35-.36h32.49a.36.36 0 01.36.36zM109.83 122.35H77.34a7.12 7.12 0 00-7.1 7.11v40.95a7.11 7.11 0 007.1 7.1h32.49a7.12 7.12 0 007.11-7.1v-40.95a7.12 7.12 0 00-7.11-7.11zm.36 48.06a.36.36 0 01-.36.35H77.34a.35.35 0 01-.35-.35v-40.95a.36.36 0 01.35-.36h32.49a.36.36 0 01.36.36zM30.34 116.07h19.25a3.38 3.38 0 000-6.75H30.34a3.38 3.38 0 000 6.75zM84 116.07h19.25a3.38 3.38 0 100-6.75H84a3.38 3.38 0 000 6.75zM137.59 116.07h19.24a3.38 3.38 0 100-6.75h-19.24a3.38 3.38 0 100 6.75zM59.94 183.22H20a3.38 3.38 0 000 6.78h40a3.38 3.38 0 100-6.75zM59.94 194.83H20a3.38 3.38 0 000 6.75h40a3.38 3.38 0 100-6.75zM59.94 206.43H20a3.38 3.38 0 000 6.75h40a3.38 3.38 0 100-6.75zM113.56 183.22H73.61a3.38 3.38 0 000 6.75h40a3.38 3.38 0 100-6.75zM113.56 194.83H73.61a3.38 3.38 0 000 6.75h40a3.38 3.38 0 100-6.75zM113.56 206.43H73.61a3.38 3.38 0 000 6.75h40a3.38 3.38 0 100-6.75zM167.18 183.22h-39.94a3.38 3.38 0 100 6.75h39.94a3.38 3.38 0 100-6.75zM167.18 194.83h-39.94a3.38 3.38 0 100 6.75h39.94a3.38 3.38 0 100-6.75zM167.18 206.43h-39.94a3.38 3.38 0 100 6.75h39.94a3.38 3.38 0 100-6.75zM21 88.87h145.16a6.7 6.7 0 006.69-6.7V42.94a6.7 6.7 0 00-6.69-6.69h-64.7a3.38 3.38 0 000 6.75h64.65v39.12h-145V43h64.6a3.38 3.38 0 100-6.75H21a6.7 6.7 0 00-6.7 6.69v39.23a6.71 6.71 0 006.7 6.7zM163.46 122.35H131a7.12 7.12 0 00-7.11 7.11v40.95a7.12 7.12 0 007.11 7.1h32.49a7.11 7.11 0 007.1-7.1v-12.6a3.38 3.38 0 10-6.75 0v12.6a.35.35 0 01-.35.35H131a.36.36 0 01-.36-.35v-40.95a.36.36 0 01.36-.36h32.49a.36.36 0 01.35.36v12.6a3.38 3.38 0 006.75 0v-12.6a7.12 7.12 0 00-7.13-7.11z"/></g></g></svg>
              </span>
              <p >Full source code availability</p> 
            </div>

            <div>
              
              <span className=" p-4 flex justify-center items-center">
              <svg width="30"  height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 230.68 230.68"><defs><style></style></defs><g id="Слой_2" fill="#1fc1e5" data-name="Слой 2"><g id="Слой_1-2" data-name="Слой 1"><path class="cls-1" d="M230.68 115.34A115.34 115.34 0 1059.25 216.09a3.67 3.67 0 00.82.46 115.16 115.16 0 00110.54 0 3.67 3.67 0 00.82-.46 115.41 115.41 0 0059.25-100.75zm-223 0A107.65 107.65 0 11173 206.2v-21.65a57.88 57.88 0 00-28.64-49.78 3.85 3.85 0 00-4 .08 46.67 46.67 0 01-50 0 3.85 3.85 0 00-4-.08 57.88 57.88 0 00-28.64 49.78v21.65a107.66 107.66 0 01-50.03-90.86zm57.67 95.32v-26.11a50.18 50.18 0 0122.89-42 54.46 54.46 0 0054.18 0 50.19 50.19 0 0122.89 42v26.11a107.46 107.46 0 01-100 0z"/><path class="cls-1" d="M115.34 126.87a38.45 38.45 0 10-38.45-38.44 38.49 38.49 0 0038.45 38.44zm0-69.2a30.76 30.76 0 11-30.76 30.76 30.8 30.8 0 0130.76-30.76z"/></g></g></svg>
             </span>
             <p > Custom branding</p> 
           </div>
          
        </div>
           
        </div>
    </section>
  );
};

export default SelfPossibilities;